### 함수의 기본 형태 ###

'''

    - 특정작업을 독립적으로 수행하는 프로그램의 단위
    - 특정기능을 수행하는 명령어들을 def안에 모아 놓은 것
    - 함수를 만드는 이유

    1) 소스코드의 중복을 없애 줍니다.
    2) 한번 만들어진 함수를 여러번 호출하여서 사용할 수 있습니다.
    3) 복잡한 프로그램을 작업단위로 분해할 수 있습니다.
    4) 만들어진 함수를 다른 개발자, 다른 프로그램에서도 사용할 수 있습니다.

    - 함수의 분류

    1) 내장함수 : 파이썬에 기본적으로 내장되어 있는 함수
                    print() , input()
    2) 외장함수 : 외부 파일에서 import하여 사용할 수 있는 함수
                    random.randint()

'''

def adder(arg1,arg2):
    result = arg1 + arg2
    return result

print(adder(100,10))
res1 = adder(200,20)
print(res1)