### 변수명명(식별 규칙) ###

# 1. 절대적 규칙

#1) 숫자를 사용할 수 있으나 숫자로 변수명을 지을 수 없다.
#10000won = 10000
#won10000 = 10000

#2) 언더스코어,언더바 '_' 를 제외한 특수문자를 사용할 수 없다.
#data! = 10000 # x
#!data = 10000 # x
#_data = 10000 # o
#data_ = 10000 # o

#3) 띄어쓰기를 사용 할 수 없다.
#student age = 10000

#4) 예약어를 사용 할 수 없다.
#if = 10000
#while = 10000


# 2. 암묵적 규칙

#1) 변수의 첫글자는 소문자로 시작한다. ( 클래스의 이름은 대문자 )
singerName = "maroon5"

#2) 두 단어가 이어지는 경우 이어지는 단어의 첫글자를 대문자로 작성한다.
studentAge    = 15
studentWeight = 70.5

#3) 두 단어가 이어지는 부분을 _로 이어준다.
student_age    = 15
student_weight = 70.5

#4) 상수의 이름은 모두 대문자로 한다.
LIMIT = 100

#5) 상수의 이름이 두 단어로 이어질 경우 _로 이어준다.
MAX_NUMBER = 100

#6) 변수명의 이름을 '최선을 다해서' 짓는다.
a = 70.5               # 절대 안됨
siteCode = 'A Site'    # o



