### 서식있는 출력 ###

'''

    1) 문자열 포매팅 : 문자열 밖에서 문자열 안으로 데이터를 삽입

    문자열 포맷코드 : 문자열을 받는 형식

    %d : 정수
    %f : 실수
    %s : 문자 , 문자열 ( 다른언어는 문자와 문자열을 구분합니다. )

'''

#1) 기본예제
print("정수는 : %d 입니다." % 15)
print("실수는 : %f 입니다." % 15.234)
print("문자열은 : %s 입니다." % "문자열(글씨)")
print("파이썬은 문자도 %s로 가능합니다." % '#')
print()

#2) %뒤에 단일 데이터가 아닐 경우 데이터들을 '반드시' ()로 묶어준다.
print("이름 : %s , 나이 : %d , 키 : %f , 몸무게 : %f" % ("홍길동", 20,180.12,70.2))
print()

#3) %뒤에 연산이 있을 경우 데이터들을 '반드시' ()로 묶어준다.
print("연봉 : %d" % (900*12))
print()













