### 주석 (Comments) ###

'''

    1) 프로그램은 데이터와 명령어로 구성되어 있다.
        그 외에 프로그램에 대한 설명 ( 주석 )이 있다.

    2) 프로그램에 대한 설명 or 코드 테스트의 목적으로 주석을 사용한다.

    3) 컴파일러 및 인터프리터는 주석처리가 되어있는 부분을
       코드로 인식하지 않는다.

    4) 주석을 만드는 방법

    한줄 주석 : #
    여러줄 주석 : 싱글쿼터 3개 or 더블쿼터 두개
                 +@) 마우스 블록 + alt + /

'''

# 블록주석을 겹쳐서 사용할 수 없기 때문에 싱글쿼터와 더블쿼터를 잘 활용해야 한다.

"""
'''
print("--- Comment Test --- ")
print("comment1")
print("comment2")
'''
print("comment3")
print("comment4")
print("comment5")
"""







